# ComponentRepeaterSlotFailures Properties

---
The BuiltInFailuresComponentRepeaterSlotFailures type exposes the following members.
| Name| Description
---|---|---
| ComponentRepeaterSlot_InvalidFamilyOnReload|  Reloaded family not appropriate for repeated component.
Top
#### Reference
BuiltInFailuresComponentRepeaterSlotFailures Class
Autodesk.Revit.DB Namespace